##  Week-4 Assignment Solution: Pandas Basics

In [63]:
# importing pandas
import pandas as pd

## 1. Creating DataFrames(10 Marks)
Create a Pandas DataFrame with the following data:

Name     Age  Gender  Score

Alice    23   Female  85

Bob      25   Male    78

Charlie  22   Male    90

Diana    24   Female  92

Tasks:

1. Display the first 3 rows of the DataFrame. (2 Marks)
2. Get the column names and data types. (2 Marks)
3. Add a new column named Passed with a value of True if the Score is greater than 80, otherwise False. (3 Marks)
4. Drop the Gender column from the DataFrame. (3 Marks)

In [64]:
df = pd.DataFrame({
    'Name': ['Alice','Bob','Charlie','Diana'],
    'Age': [23,25,22,24],
    'Gender': ['Female','Male','Male','Female'],
    'Score': [85,78,90,92]
})

In [65]:
# Task 1 Solution
# Display the first 3 rows of the DataFrame.
df.head(3)

      Name  Age  Gender  Score
0    Alice   23  Female     85
1      Bob   25    Male     78
2  Charlie   22    Male     90

In [66]:
# Task 2 Solution
# Get the column names and data types.
df.columns
df.dtypes

Name      object
Age        int64
Gender    object
Score      int64
dtype: object

In [67]:
# Task 3 Solution
# Add a new column named Passed with a value of True if the Score is greater than 80, otherwise False
df['Passed'] = df.Score.map(lambda x: True if x > 80 else False)
df

      Name  Age  Gender  Score  Passed
0    Alice   23  Female     85    True
1      Bob   25    Male     78   False
2  Charlie   22    Male     90    True
3    Diana   24  Female     92    True

In [68]:
# Task 4 Solution
# Drop the Gender column from the DataFrame.
df = df.drop('Gender', axis=1)
df

      Name  Age  Score  Passed
0    Alice   23     85    True
1      Bob   25     78   False
2  Charlie   22     90    True
3    Diana   24     92    True

## 2. Indexing and Slicing(10 Marks)

Use the DataFrame from Task 1:
1. Select and display only the Name and Score columns. (2 Marks)
2. Filter and display rows where Score is greater than 85. (3 Marks)
3. Display the row for the student named "Bob" using loc. (2 Marks)
4. Display the last 2 rows of the DataFrame. (3 Marks)

In [69]:
# Task 1 Solution
# Select and display only the Name and Score columns. 
df.loc[:, ['Name','Score']]

      Name  Score
0    Alice     85
1      Bob     78
2  Charlie     90
3    Diana     92

In [70]:
# Task 2 Solution
# Filter and display rows where Score is greater than 85.
df.loc[df.Score>85]

      Name  Age  Score  Passed
2  Charlie   22     90    True
3    Diana   24     92    True

In [71]:
# Task 3 Solution
# Display the row for the student named "Bob" using loc.
df.loc[df.Name == "Bob"]

  Name  Age  Score  Passed
1  Bob   25     78   False

In [72]:
# Task 4 Solution
# Display the last 2 rows of the DataFrame. 
df.iloc[-2:]

      Name  Age  Score  Passed
2  Charlie   22     90    True
3    Diana   24     92    True

## 3. Data Analysis (15 Marks)

Use the DataFrame from Task 1:
1. Calculate the average age of students. (2 Marks)
2. Find the maximum and minimum scores. (2 Marks)
3. Count the number of students who passed. (3 Marks)
4. Group the data by the Passed column and calculate the average score for each group. (4 Marks)
5. Sort the DataFrame by Score in descending order. (4 Marks)

In [73]:
# Task 1 Solution
# Calculate the average age of students. 
df.Age.mean()

23.5

In [74]:
# Task 2 Solution
# Find the maximum and minimum scores.
df.Score.agg(['max','min'])

max    92
min    78
Name: Score, dtype: int64

In [75]:
# Task 3 Solution
# Count the number of students who passed.
df.Passed.sum()

3

In [76]:
# Task 4 Solution
# Group the data by the Passed column and calculate the average score for each group. 
df.groupby('Passed').mean()['Score']

Passed
False    78.0
True     89.0
Name: Score, dtype: float64

In [77]:
# Task 5 Solution
# Sort the DataFrame by Score in descending order. 
df.Score.sort_values(ascending=False)

3    92
2    90
0    85
1    78
Name: Score, dtype: int64

## 4. Importing and Exporting Data(5 Marks)
1. Save the DataFrame from Task 1 as a CSV file named students.csv. (2 Marks)
2. Read the students.csv file back into a new DataFrame and display it. (3 Marks)

In [78]:
# Task 1 Solution
# Save the DataFrame from Task 1 as a CSV file named students.csv. 
df.to_csv('students.csv')

In [79]:
# Task 2 Solution
# Read the students.csv file back into a new DataFrame and display it.
new_df = pd.read_csv('students.csv',index_col=0)
new_df.head()

      Name  Age  Score  Passed
0    Alice   23     85    True
1      Bob   25     78   False
2  Charlie   22     90    True
3    Diana   24     92    True

## 5. Real-World Problem(10 Marks)
Create a DataFrame with the following sales data:

Product     Category     Sales     Discount

Laptop     Electronics   500       50

Smartphone Electronics   300       30

Desk       Furniture     200       20

Chair      Furniture     150       15

Tasks:
1. Calculate a new column named Net Sales as Sales - Discount. (3 Marks)
2. Group the data by Category and calculate total sales for each category. (4 Marks)
3. Find the product with the highest net sales. (3 Marks)

In [80]:
df = pd.DataFrame({
    'Product':['Laptop','Smartphone','Desk','Chair'],
    'Category':['Electronics','Electronics','Furniture','Furniture'],
    'Sales':[500,300,200,150],
    'Discount':[50,30,20,15]
})

In [81]:
df.head()

      Product     Category  Sales  Discount
0      Laptop  Electronics    500        50
1  Smartphone  Electronics    300        30
2        Desk    Furniture    200        20
3       Chair    Furniture    150        15

In [82]:
# Task 1 Solution
# Calculate a new column named Net Sales as Sales - Discount.
df['Net Sales'] = df.Sales - df.Discount
df

      Product     Category  Sales  Discount  Net Sales
0      Laptop  Electronics    500        50        450
1  Smartphone  Electronics    300        30        270
2        Desk    Furniture    200        20        180
3       Chair    Furniture    150        15        135

In [83]:
# Task 2 Solution
# Group the data by Category and calculate total sales for each category.
df.groupby('Category').sum()['Sales']

Category
Electronics    800
Furniture      350
Name: Sales, dtype: int64

In [84]:
# Task 3 Solution
# Find the product with the highest net sales.
df.loc[df['Net Sales'] == df['Net Sales'].max()].Product

0    Laptop
Name: Product, dtype: object